## [Pandas tutorial from datacamp](https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python)

In [1]:
import numpy as np
import pandas as pd

In [96]:
df = pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]], index=range(0,3), columns=['A', 'B', 'C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [95]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [5]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
df.iloc[0][0]

1

In [7]:
df.iat[0,0]

1

In [8]:
df.loc[0]['A']

1

In [9]:
df.at[0,'A']

1

In [10]:
df.get_value(0,'A')

1

In [11]:
df.iloc[0]

A    1
B    2
C    3
Name: 0, dtype: int64

In [12]:
df.loc[:,'A']

0    1
1    4
2    7
Name: A, dtype: int64

In [15]:
df['D'] = df.index

In [24]:
df2 = df.set_index('B')

In [25]:
df2

   A  C  D
B
2  1  3  0
5  4  6  1
8  7  9  2

In [27]:
df2.reset_index(level=0, drop=False)

   B  A  C  D
0  2  1  3  0
1  5  4  6  1
2  8  7  9  2

In [51]:
df = pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]], index=range(0,3), columns=['A', 'B', 'C'])

In [52]:
df.drop('B', axis=1, inplace=False)

   A  C
0  1  3
1  4  6
2  7  9

In [53]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [62]:
df.drop(df.index[1])

   A  B  C
0  1  2  3
2  7  8  9

In [64]:
df.drop(1)

   A  B  C
0  1  2  3
2  7  8  9

In [66]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [67]:
newcols = {
    'A': 'new_column_1', 
    'B': 'new_column_2', 
    'C': 'new_column_3'
}

In [68]:
df.rename(columns=newcols, inplace=False)

   new_column_1  new_column_2  new_column_3
0             1             2             3
1             4             5             6
2             7             8             9

In [69]:
df.rename(index={1:'a'})

   A  B  C
0  1  2  3
a  4  5  6
2  7  8  9

In [71]:
df.rename(columns={'A':'d'})

   d  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [79]:
old = [1, 2, 3]
new = ['bad', 'good', 'moderate']
df.replace(old, new)

     A     B         C
0  bad  good  moderate
1    4     5         6
2    7     8         9

In [73]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [86]:
for index, row in df.iterrows():
    print(row['A'])

1
4
7

In [ ]:
df.to_csv('myDataFrame.csv')

In [97]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [99]:
np.c_[df]

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

## [Pandas Visualization](https://pandas.pydata.org/pandas-docs/stable/visualization.html#visualization-scatter-matrix)

Convert Dataframe to others and other to Dataframe